zmattis/University-of-Pittsburgh/ECE-1770/Register-Memory/startup_stm32l476.s
;******************** (C) Yifeng ZHU *******************************************
; @file    startup_stm32l476xx.s
; @author  Yifeng Zhu
; @version V2.1.0
; @date    May-17-2015
; @note    
; @brief   This is a modified startup code to support Assembly Programs without
;          using libraries. Key changes include:
;		   (1) Remove the call of SystemInit()
;		   (2) Add codes to initialize memory. 
;			   Copy the Read/Write data section (RW) and the Zero Initialized 
;			   section (ZI) from the flash to RAM
;          (3) Enable FPU
; @note
;           This code is for the book "Embedded Systems with ARM Cortex-M 
;           Microcontrollers in Assembly Language and C, Yifeng Zhu, 
;           ISBN-13: 978-0982692639, ISBN-10: 0982692633
; @attension
;           This code is provided for education purpose. The author shall not be 
;           held liable for any direct, indirect or consequential damages, for any 
;           reason whatever. More information can be found from book website: 
;           http://www.eece.maine.edu/~zhu/book
;*******************************************************************************

;******************** (C) COPYRIGHT 2015 STMicroelectronics ********************
;* File Name          : startup_stm32l476xx.s
;* Author             : MCD Application Team
;* Version            : V1.0.1
;* Date               : 16-September-2015
;* Description        : STM32L476xx Ultra Low Power devices vector table for MDK-ARM toolchain.
;*                      This module performs:
;*                      - Set the initial SP
;*                      - Set the initial PC == Reset_Handler
;*                      - Set the vector table entries with the exceptions ISR address
;*                      - Branches to __main in the C library (which eventually
;*                        calls main()).
;*                      After Reset the Cortex-M4 processor is in Thread mode,
;*                      priority is Privileged, and the Stack is set to Main.
;* <<< Use Configuration Wizard in Context Menu >>>
;*******************************************************************************
;*
;* Redistribution and use in source and binary forms, with or without modification,
;* are permitted provided that the following conditions are met:
;*   1. Redistributions of source code must retain the above copyright notice,
;*      this list of conditions and the following disclaimer.
;*   2. Redistributions in binary form must reproduce the above copyright notice,
;*      this list of conditions and the following disclaimer in the documentation
;*      and/or other materials provided with the distribution.
;*   3. Neither the name of STMicroelectronics nor the names of its contributors
;*      may be used to endorse or promote products derived from this software
;*      without specific prior written permission.
;*
;* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
;* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
;* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
;* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
;* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
;* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
;* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
;* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
;* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
;* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
;*
;*******************************************************************************
;
; Amount of memory (in bytes) allocated for Stack
; Tailor this value to your application needs
; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

;******************** Added by Dr. Zhu *****************************************************
                ; ROM:  Symbols defined by the linker
                IMPORT  |Load$$ER_IROM1$$Base|             ; Entry of Bootloader
                
                IMPORT  |Image$$ER_IROM1$$RO$$Base|        ; Start of RO output section
                IMPORT  |Image$$ER_IROM1$$RO$$Limit|       ; First byte beyond the end of RO output section
                IMPORT  |Image$$ER_IROM1$$RO$$Length|      ; Size of RO output section
                
                IMPORT  |Image$$ER_IROM1$$RW$$Base|
                IMPORT  |Image$$ER_IROM1$$RW$$Length|
                IMPORT  |Image$$ER_IROM1$$RW$$Limit|
                
                IMPORT  |Image$$ER_IROM1$$ZI$$Base|
                IMPORT  |Image$$ER_IROM1$$ZI$$Length|
                IMPORT  |Image$$ER_IROM1$$ZI$$Limit|
                
                ; RAM: Symbols defined by the linker
                IMPORT  |Load$$RW_IRAM1$$Base|             ; Load Address 
                IMPORT  |Image$$RW_IRAM1$$Base|            ; Start of RW output section
                IMPORT  |Image$$RW_IRAM1$$Length|
                IMPORT  |Image$$RW_IRAM1$$Limit|
                
                IMPORT  |Image$$RW_IRAM1$$RO$$Base|
                IMPORT  |Image$$RW_IRAM1$$RO$$Base|
                IMPORT  |Image$$RW_IRAM1$$RO$$Length|        
                
                IMPORT  |Image$$RW_IRAM1$$RW$$Base|       ; Start of RW output section
                IMPORT  |Image$$RW_IRAM1$$RW$$Limit|      ; End of RW output section
                IMPORT  |Image$$RW_IRAM1$$RW$$Length|     ; Size of RW output section
                
                IMPORT  |Image$$RW_IRAM1$$ZI$$Base|       ; Start of ZI output section
                IMPORT  |Image$$RW_IRAM1$$ZI$$Limit|      ; End of ZI output section
                IMPORT  |Image$$RW_IRAM1$$ZI$$Length|     ; Size of ZI output section
;******************** END ************************************************************************


